; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	image1 - mode
	spectrograph4 - mode
	spectrograph0 - mode
	thermograph3 - mode
	infrared2 - mode
	image5 - mode
	thermograph6 - mode
	Star1 - direction
	Star5 - direction
	Star6 - direction
	Star2 - direction
	Star4 - direction
	GroundStation3 - direction
	Star0 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph6)
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph6)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument2 image5)
	(supports instrument2 image1)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument3 thermograph6)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
)
(:goal (and
	(pointing satellite0 Star5)
	(have_image Star7 image1)
	(have_image Star8 spectrograph0)
	(have_image Star8 thermograph6)
	(have_image Star9 infrared2)
	(have_image Star9 thermograph3)
	(have_image Phenomenon10 thermograph6)
	(have_image Phenomenon10 spectrograph0)
	(have_image Star11 infrared2)
	(have_image Star11 thermograph3)
))

)

; plan
1. (turn_to satellite2 groundstation3 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 10
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite2 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite2 star11 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star11)
   goals met: 0 of 10
5. (turn_to satellite1 star0 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star0)
   goals met: 0 of 10
6. (turn_to satellite0 star2 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star2)
   goals met: 0 of 10
7. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 10
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
9. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 10
10. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 10
11. (take_image satellite2 star11 instrument3 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 1 of 10
12. (turn_to satellite0 phenomenon10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 10
13. (take_image satellite0 phenomenon10 instrument0 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 2 of 10
14. (take_image satellite0 phenomenon10 instrument0 thermograph6)
   added: (have_image phenomenon10 thermograph6)
   goals met: 3 of 10
15. (turn_to satellite0 star11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star11)
   goals met: 3 of 10
16. (take_image satellite0 star11 instrument0 infrared2)
   added: (have_image star11 infrared2)
   goals met: 4 of 10
17. (turn_to satellite0 star8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star8)
   goals met: 4 of 10
18. (take_image satellite0 star8 instrument0 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 5 of 10
19. (take_image satellite0 star8 instrument0 thermograph6)
   added: (have_image star8 thermograph6)
   goals met: 6 of 10
20. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 6 of 10
21. (take_image satellite0 star9 instrument0 infrared2)
   added: (have_image star9 infrared2)
   goals met: 7 of 10
22. (turn_to satellite0 star5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star5)
   goals met: 8 of 10
23. (turn_to satellite1 star7 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star7)
   goals met: 8 of 10
24. (take_image satellite1 star7 instrument2 image1)
   added: (have_image star7 image1)
   goals met: 9 of 10
25. (turn_to satellite2 star9 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star9)
   goals met: 9 of 10
26. (take_image satellite2 star9 instrument3 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 10 of 10
